In [1]:
import pandas as pd

In [2]:
dict1={'Roll':[11,12,13,14,15,16,17,18],
      'Name':['ssdkal','ssdop','weio','opoi','kdie','riw','aqplrid','eoworu'],
       'Marks':[78,45,65,87,34,92,21,52],
      'Address':['Pune','Mumbai','Nagpur','Pune','Mumbai','Nagpur','Pune','Mumbai']
      }
df=pd.DataFrame(dict1)

In [3]:
df

   Roll     Name  Marks Address
0    11   ssdkal     78    Pune
1    12    ssdop     45  Mumbai
2    13     weio     65  Nagpur
3    14     opoi     87    Pune
4    15     kdie     34  Mumbai
5    16      riw     92  Nagpur
6    17  aqplrid     21    Pune
7    18   eoworu     52  Mumbai

In [4]:
df['Name']

0     ssdkal
1      ssdop
2       weio
3       opoi
4       kdie
5        riw
6    aqplrid
7     eoworu
Name: Name, dtype: object

In [5]:
df[['Name','Address']]

      Name Address
0   ssdkal    Pune
1    ssdop  Mumbai
2     weio  Nagpur
3     opoi    Pune
4     kdie  Mumbai
5      riw  Nagpur
6  aqplrid    Pune
7   eoworu  Mumbai

In [6]:
df.iloc[0]

Roll           11
Name       ssdkal
Marks          78
Address      Pune
Name: 0, dtype: object

In [7]:
df

   Roll     Name  Marks Address
0    11   ssdkal     78    Pune
1    12    ssdop     45  Mumbai
2    13     weio     65  Nagpur
3    14     opoi     87    Pune
4    15     kdie     34  Mumbai
5    16      riw     92  Nagpur
6    17  aqplrid     21    Pune
7    18   eoworu     52  Mumbai

In [8]:
df.iloc[-1]

Roll           18
Name       eoworu
Marks          52
Address    Mumbai
Name: 7, dtype: object

In [9]:
df.iloc[2:6:]

   Roll  Name  Marks Address
2    13  weio     65  Nagpur
3    14  opoi     87    Pune
4    15  kdie     34  Mumbai
5    16   riw     92  Nagpur

In [10]:
df.iloc[[4,3,1]]

   Roll   Name  Marks Address
4    15   kdie     34  Mumbai
3    14   opoi     87    Pune
1    12  ssdop     45  Mumbai

In [11]:
df.iloc[1::2]

   Roll    Name  Marks Address
1    12   ssdop     45  Mumbai
3    14    opoi     87    Pune
5    16     riw     92  Nagpur
7    18  eoworu     52  Mumbai

In [12]:
df.iloc[1::2][['Name','Roll']]

     Name  Roll
1   ssdop    12
3    opoi    14
5     riw    16
7  eoworu    18

In [13]:
df["Blood Group"]=['AB','B+','AB-','O','B-','A','A+','O-']

In [14]:
df

   Roll     Name  Marks Address Blood Group
0    11   ssdkal     78    Pune          AB
1    12    ssdop     45  Mumbai          B+
2    13     weio     65  Nagpur         AB-
3    14     opoi     87    Pune           O
4    15     kdie     34  Mumbai          B-
5    16      riw     92  Nagpur           A
6    17  aqplrid     21    Pune          A+
7    18   eoworu     52  Mumbai          O-

In [15]:
df.loc[len(df.index)]=[23,'Pranesh',94,'Kolhapur','B+']

In [16]:
df

   Roll     Name  Marks   Address Blood Group
0    11   ssdkal     78      Pune          AB
1    12    ssdop     45    Mumbai          B+
2    13     weio     65    Nagpur         AB-
3    14     opoi     87      Pune           O
4    15     kdie     34    Mumbai          B-
5    16      riw     92    Nagpur           A
6    17  aqplrid     21      Pune          A+
7    18   eoworu     52    Mumbai          O-
8    23  Pranesh     94  Kolhapur          B+

In [17]:
temp=df.drop('Roll',axis=1)
temp

      Name  Marks   Address Blood Group
0   ssdkal     78      Pune          AB
1    ssdop     45    Mumbai          B+
2     weio     65    Nagpur         AB-
3     opoi     87      Pune           O
4     kdie     34    Mumbai          B-
5      riw     92    Nagpur           A
6  aqplrid     21      Pune          A+
7   eoworu     52    Mumbai          O-
8  Pranesh     94  Kolhapur          B+

In [18]:
# operation in series

In [19]:
df['Marks']+10

0     88
1     55
2     75
3     97
4     44
5    102
6     31
7     62
8    104
Name: Marks, dtype: int64

In [20]:
df['Marks'].mean()

63.111111111111114

In [21]:
df['Marks']<60

0    False
1     True
2    False
3    False
4     True
5    False
6     True
7     True
8    False
Name: Marks, dtype: bool

In [22]:
df[df['Marks']<60]

   Roll     Name  Marks Address Blood Group
1    12    ssdop     45  Mumbai          B+
4    15     kdie     34  Mumbai          B-
6    17  aqplrid     21    Pune          A+
7    18   eoworu     52  Mumbai          O-

In [23]:
df['Address']=='Pune'

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: Address, dtype: bool

In [24]:
df[df['Address']=='Pune']

   Roll     Name  Marks Address Blood Group
0    11   ssdkal     78    Pune          AB
3    14     opoi     87    Pune           O
6    17  aqplrid     21    Pune          A+

In [25]:
df[df['Address']=='Pune']['Marks'].mean()

62.0

In [26]:
df[df['Address']=='Mumbai']['Marks'].mean()

43.666666666666664

In [27]:
df['Marks'].max()

94

In [28]:
b=df['Marks'].max()
b

94

In [29]:
p=df['Marks']==df['Marks'].max()

In [30]:
p

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
Name: Marks, dtype: bool

In [31]:
df[p]

   Roll     Name  Marks   Address Blood Group
8    23  Pranesh     94  Kolhapur          B+

In [32]:
df[p]['Name']

8    Pranesh
Name: Name, dtype: object

In [33]:
df[p]['Name'].iloc[0]

'Pranesh'

In [34]:
df[p]['Name'].loc[8]

'Pranesh'

In [35]:
dict1 = {'Roll':[11,12,13,14,15,16,17,18],
         'Name':['ssdkal','ssdop','weio','opoi','kdie','riw','aqplrid','eoworu'],
         'Marks':[78,45,65,87,34,92,21,52],
         'Address':['Pune','Mumbai','Nagpur','Pune','Mumbai','Nagpur','Pune','Mumbai']}
df = pd.DataFrame(dict1, index=['A','B','C','D','E','F','G','H'])

In [36]:
df

   Roll     Name  Marks Address
A    11   ssdkal     78    Pune
B    12    ssdop     45  Mumbai
C    13     weio     65  Nagpur
D    14     opoi     87    Pune
E    15     kdie     34  Mumbai
F    16      riw     92  Nagpur
G    17  aqplrid     21    Pune
H    18   eoworu     52  Mumbai

In [37]:
df.sort_values('Marks',ascending=False)

   Roll     Name  Marks Address
F    16      riw     92  Nagpur
D    14     opoi     87    Pune
A    11   ssdkal     78    Pune
C    13     weio     65  Nagpur
H    18   eoworu     52  Mumbai
B    12    ssdop     45  Mumbai
E    15     kdie     34  Mumbai
G    17  aqplrid     21    Pune

In [38]:
df.sort_values('Marks',ascending=False)['Name'].iloc[0]

'riw'

In [39]:
def get_topper(rank):
    return df.sort_values('Marks',ascending=False).iloc[rank-1]['Name']

In [40]:
get_topper(2)

'opoi'

In [41]:
get_topper(4)

'weio'

In [42]:
df['Address'].nunique()

3

In [43]:
df['Address'].unique()

array(['Pune', 'Mumbai', 'Nagpur'], dtype=object)

In [44]:
df['Address'].value_counts()

Pune      3
Mumbai    3
Nagpur    2
Name: Address, dtype: int64

In [45]:
df['Roll']

A    11
B    12
C    13
D    14
E    15
F    16
G    17
H    18
Name: Roll, dtype: int64

In [46]:
df['Roll'].apply(lambda x:x*x)

A    121
B    144
C    169
D    196
E    225
F    256
G    289
H    324
Name: Roll, dtype: int64

In [47]:
df['Marks'].apply(lambda x:x*2)

A    156
B     90
C    130
D    174
E     68
F    184
G     42
H    104
Name: Marks, dtype: int64

In [49]:
df['Roll'].apply(lambda x:'even' if x%2==0 else 'odd')

A     odd
B    even
C     odd
D    even
E     odd
F    even
G     odd
H    even
Name: Roll, dtype: object

In [50]:
df

   Roll     Name  Marks Address
A    11   ssdkal     78    Pune
B    12    ssdop     45  Mumbai
C    13     weio     65  Nagpur
D    14     opoi     87    Pune
E    15     kdie     34  Mumbai
F    16      riw     92  Nagpur
G    17  aqplrid     21    Pune
H    18   eoworu     52  Mumbai

In [54]:
df['City Code']=df['Address'].apply(lambda x:x[0:2])

In [55]:
df

   Roll     Name  Marks Address City Code
A    11   ssdkal     78    Pune        Pu
B    12    ssdop     45  Mumbai        Mu
C    13     weio     65  Nagpur        Na
D    14     opoi     87    Pune        Pu
E    15     kdie     34  Mumbai        Mu
F    16      riw     92  Nagpur        Na
G    17  aqplrid     21    Pune        Pu
H    18   eoworu     52  Mumbai        Mu

In [58]:
df.groupby('Address').mean()

         Roll      Marks
Address
Mumbai   15.0  43.666667
Nagpur   14.5  78.500000
Pune     14.0  62.000000

In [60]:
df.groupby('Address')['Marks'].mean()

Address
Mumbai    43.666667
Nagpur    78.500000
Pune      62.000000
Name: Marks, dtype: float64

In [61]:
df.groupby('Address')['Marks'].min()

Address
Mumbai    34
Nagpur    65
Pune      21
Name: Marks, dtype: int64

In [62]:
df.groupby('Address')['Marks'].max()

Address
Mumbai    52
Nagpur    92
Pune      87
Name: Marks, dtype: int64

In [63]:
# reading exte3rnal files

In [66]:
df_students=pd.read_excel('../DSML15/stud_db.xlsx',sheet_name='XII')

In [67]:
df_students

   Roll Name  Marks Address  Dept
0     1   qw     76    Pune     1
1     2   df     45  Mumbai     1
2     3   vc     56  Nagpur     1
3     4   bn     78    Pune     2
4     5   hj     74  Mumbai     2
5     6   yu     49  Nagpur     2
6     7   fg     68    Pune     2
7     8   tr     84  Mumbai     1

In [69]:
df_students.groupby('Address')['Marks'].mean()

Address
Mumbai    67.666667
Nagpur    52.500000
Pune      74.000000
Name: Marks, dtype: float64

In [70]:
df_students.groupby('Dept').mean()['Marks']

Dept
1    65.25
2    67.25
Name: Marks, dtype: float64

In [71]:
df_students.groupby('Dept')['Marks'].mean()

Dept
1    65.25
2    67.25
Name: Marks, dtype: float64

In [73]:
df_department=pd.read_excel('../DSML15/stud_db.xlsx',sheet_name='Depts')

In [74]:
df_department

   dept_id          Name  HOD
0        1  Comp Science  XYZ
1        2    Statistics  PQR
2        3         Maths  MNO

In [83]:
print(df_students,'\n\n\n',df_department)

   Roll Name  Marks Address  Dept
0     1   qw     76    Pune     1
1     2   df     45  Mumbai     1
2     3   vc     56  Nagpur     1
3     4   bn     78    Pune     2
4     5   hj     74  Mumbai     2
5     6   yu     49  Nagpur     2
6     7   fg     68    Pune     2
7     8   tr     84  Mumbai     1


    dept_id          Name  HOD
0        1  Comp Science  XYZ
1        2    Statistics  PQR
2        3         Maths  MNO

In [84]:
pd.merge(df_students,df_department,left_on='Dept',right_on='dept_id')

   Roll Name_x  Marks Address  Dept  dept_id        Name_y  HOD
0     1     qw     76    Pune     1        1  Comp Science  XYZ
1     2     df     45  Mumbai     1        1  Comp Science  XYZ
2     3     vc     56  Nagpur     1        1  Comp Science  XYZ
3     8     tr     84  Mumbai     1        1  Comp Science  XYZ
4     4     bn     78    Pune     2        2    Statistics  PQR
5     5     hj     74  Mumbai     2        2    Statistics  PQR
6     6     yu     49  Nagpur     2        2    Statistics  PQR
7     7     fg     68    Pune     2        2    Statistics  PQR

# Assignment no 1

In [86]:
import pandas as pd

In [87]:
import warnings
warnings.filterwarnings('ignore')

In [89]:
df=pd.read_csv('../Downloads/Ecommerce Purchases')

In [90]:
df

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,"966 Castaneda Locks\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\nNorth Edwardburgh, T...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

# ** What is the average Purchase Price? **

In [92]:
df['Purchase Price'].mean()

50.34730200000025

# ** What were the highest and lowest purchase prices? **

In [93]:
df['Purchase Price'].min(),df['Purchase Price'].max()

(0.0, 99.99)

# ** How many people have English 'en' as their Language of choice on the website? **

In [102]:
a=df[df['Language']=='en'].value_counts()
a.count()

1098

# ** How many people have the job title of "Lawyer" ? **

In [115]:
l=df[df['Job']=='Lawyer'].value_counts()
l.count()

30

# ** How many people made the purchase during the AM and how many people made the purchase during PM ? **

In [113]:
df['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

# ** What are the 5 most common Job Titles? **

In [119]:
df['Job'].value_counts(ascending=False).head(5)

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Purchasing manager               27
Designer, jewellery              27
Name: Job, dtype: int64

# ** Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction? **

In [123]:
df[df['Lot']=='90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

# ** What is the email of the person with the following Credit Card Number: 4926535242672853 **

In [157]:
df[df['Credit Card']==4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

# * How many people have American Express as their Credit Card Provider *and made a purchase above $95 ?**

In [133]:
df[(df['CC Provider']=='American Express') & (df['Purchase Price']>95)].count()['Lot']

39

# ** Hard: How many people have a credit card that expires in 2025? **

In [140]:
df['Expires']=df['CC Exp Date'].apply(lambda x:x.split('/')[1])

In [146]:
df[df['Expires']=='25'].count()['Lot']

1033

# Hard: What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...)

In [153]:
df['Provider']=df['Email'].apply(lambda x:x.split('@')[1])

In [156]:
df['Provider'].value_counts(ascending=False).head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Provider, dtype: int64